const gameScript = (username) => ({
  day1: [
    `내이름은 ${username}. 평범한 대학생이다.`,
    "그리고 오늘, 처음으로 자취를 시작하게 되었다.",
    "방학 동안 편하게 쉬려고 했는데...",
    "부모님께선 나를 독립시켜버리셨다.",
    "이제부터 월세, 생활비... 모든걸 스스로 해결해야한다.",
    "집 안을 둘러보니, 아직은 낯설기만 한 자취방.",
    "뭐, 그래도 어떻게든 되겠지?",
    "목표는 간단하다. 개강까지 살아남기.",
    "그럼, 시작해볼까?",
    "그렇다면 제일 먼저 해야할건...",
    "역시 뉴스보기 일려나.",
    "아무래도 월요일엔 새로운 뉴스가 올라오니까 음음.",
    "뉴스를 잘 기억해두면 자취할 때 많은 도움이 될거야."
  ],
  day2: [
      `내이름은 ${username}. 평범한 대학생이다.`,
      "그리고 오늘, 처음으로 자취를 시작하게 되었다.",
      "방학 동안 편하게 쉬려고 했는데...",
      "부모님께선 나를 독립시켜버리셨다.",
      "이제부터 월세, 생활비... 모든걸 스스로 해결해야한다.",
      "집 안을 둘러보니, 아직은 낯설기만 한 자취방.",
      "뭐, 그래도 어떻게든 되겠지?",
      "목표는 간단하다. 개강까지 살아남기.",
      "그럼, 시작해볼까?",
      "그렇다면 제일 먼저 해야할건...",
      "역시 뉴스보기 일려나.",
      "왼쪽 위 버튼을 눌러 뉴스를 보고 오늘은 일단 자자."
    ]
});

export default gameScript;
